target/test-classes/xml/sws/getaccountdetails/Get_Account_Detail_With_Flag_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:getAccountSummaryRequest>
      <sel:includeInactiveSubscriptionFlag>TRUE</sel:includeInactiveSubscriptionFlag>
      <sel:externalSystemID>MOBILEAWARE</sel:externalSystemID>
      <sel:accountCriteria>
        <sel:accountNumber>0</sel:accountNumber>
      </sel:accountCriteria>
    </sel:getAccountSummaryRequest>
  </soapenv:Body>
</soapenv:Envelope>